---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PathReinEndHookOrient2Slab
source: html/b31ea8eb-b20f-597a-af62-c4ad7bb53d02.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PathReinEndHookOrient2Slab Property

"Alternating Bar - End Hook Orientation"

## Syntax (C#)
```csharp
public static ForgeTypeId PathReinEndHookOrient2Slab { get; }
```